kaifanzheng/STM32EncryptedCommunication/ProjectFile(EncryptedCommunication)/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <testFunctionalities.h>
#include "OLEDScreenDriver.h"
#define ARM_MATH_CM4
#include "arm_math.h"
#include "keypadDriver.h"
#include "cryptosystem.h"
#include "stm32l4s5i_iot01_hsensor.h"
#include "stm32l4s5i_iot01_tsensor.h"

#include "../Components/hts221/hts221.c"
#include "stm32l4s5i_iot01_tsensor.h"
#include "stm32l4s5i_iot01_hsensor.h"

#include<stdio.h>
#include <stdlib.h>
#include <string.h>
#include <time.h>
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define note_1_size 32
#define note_2_size 36
#define note_3_size 38
#define note_4_size 34
#define time_between_note 130
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
DAC_HandleTypeDef hdac1;
DMA_HandleTypeDef hdma_dac1_ch2;

I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c2;

OSPI_HandleTypeDef hospi1;

SPI_HandleTypeDef hspi3;

TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;

UART_HandleTypeDef huart4;

/* USER CODE BEGIN PV */
uint8_t ringtone_note_1[note_1_size];
uint8_t ringtone_note_2[note_2_size];
uint8_t ringtone_note_3[note_3_size];
uint8_t ringtone_note_4[note_4_size];

uint8_t ringtone[22932]; // All notes in one array, DMA can be performed in one go

uint8_t mainMenuPage = 0;
const uint8_t maxMenuPageNum = 5;
uint32_t message_history_buffer[500][15];
uint32_t message_history_encoded[500][15];
uint32_t next_message_in_history = 0;

uint32_t publicMod = 3127;
uint32_t publicPower = 3;
uint32_t thePrivateKey = 2011;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_DAC1_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM3_Init(void);
static void MX_OCTOSPI1_Init(void);
static void MX_I2C1_Init(void);
static void MX_SPI3_Init(void);
static void MX_UART4_Init(void);
static void MX_I2C2_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
int getMessageMain();
float read_temperature(){
	return BSP_TSENSOR_ReadTemp();
}

float read_humidity(){
	return BSP_HSENSOR_ReadHumidity();
}


void generate_ringtone(uint8_t pDest[], uint8_t harmonic){
	  //================================= GENERATE SINE WAVES FOR RINGTONE =================================
	  float offset = ((2.0/3.0)*256)/2.0; // Add first sine wave and 2nd harmonic
	  float offset_harmonic = ((2.0/3.0)*256)/8.0;
	  int note_sample_length = 22932/4;  // = 5733
	  float input = 0;
	  float step_size;
	  float input_harmonic_1 = 0;
	  float step_size_harmonic_1;
	  float input_harmonic_2 = 0;
	  float step_size_harmonic_2;
	  // Fill array with values:
	  for(int i = 0; i < 22932; i++){
		  if(i == 0){
			  input = 0;
			  step_size = (2.0*PI)/note_1_size;
			  step_size_harmonic_1 = (2.0*PI)/(note_1_size * 2);
			  step_size_harmonic_2 = (2.0*PI)/(note_1_size * 4);
		  } else if(i == note_sample_length){
			  input = 0;
			  step_size = (2.0*PI)/note_2_size;
			  step_size_harmonic_1 = (2.0*PI)/(note_2_size * 2);
			  step_size_harmonic_2 = (2.0*PI)/(note_2_size * 4);
		  } else if(i == note_sample_length * 2){
			  input = 0;
			  step_size = (2.0*PI)/note_3_size;
			  step_size_harmonic_1 = (2.0*PI)/(note_3_size * 2);
			  step_size_harmonic_2 = (2.0*PI)/(note_3_size * 4);
		  } else if(i == note_sample_length * 3){
			  input = 0;
			  step_size = (2.0*PI)/note_4_size;
			  step_size_harmonic_1 = (2.0*PI)/(note_4_size * 2);
			  step_size_harmonic_2 = (2.0*PI)/(note_4_size * 4);
		  }
		  pDest[i] = offset + arm_sin_f32(input)*offset;
		  if(harmonic) pDest[i] += offset_harmonic + arm_sin_f32(input_harmonic_1)*offset_harmonic;
		  // pDest[i] += offset_harmonic + arm_sin_f32(input_harmonic_2)*offset_harmonic;
		  input += step_size;
		  input_harmonic_1 += step_size_harmonic_1;
		  input_harmonic_2 += step_size_harmonic_2;
	  }
}

void play_ringtone(){
	HAL_DAC_Start_DMA(&hdac1, DAC_CHANNEL_2, ringtone, 22932, DAC_ALIGN_8B_R);
}

//ui start###################################################################
void clearBufferString(uint8_t *buffer, uint8_t bufferSize){
	for(uint8_t i=0;i<bufferSize;i++){
		buffer[i] = 0;
	}
}
void hardcopy_char(uint32_t *buffer, uint32_t bufferSize, uint32_t *bufferCopy){
	for(uint8_t i =0;i<bufferSize;i++){
		bufferCopy[i] = buffer[i];
	}
}
void displayMainPageOne(){
	printToScreen("main menu");
	printToScreen(" ");
	printToScreen(" ");
	printToScreen("init communicate>");
}

void displayMainPageTwo(){
	printToScreen("main menu");
	printToScreen(" ");
	printToScreen(" ");
	printToScreen("<  send message >");
}

void displayMainPageThree(){
	printToScreen("main menu");
	printToScreen(" ");
	printToScreen(" ");
	printToScreen("< receive message>");
}

void displayMainPageFour(){
	printToScreen("main menu");
	printToScreen(" ");
	printToScreen(" ");
	printToScreen("<message history>");
}

void displayMainPageFive(){
	printToScreen("main menu");
	printToScreen(" ");
	printToScreen(" ");
	printToScreen("<show temperature ");
}

void changePageMainPage(){
	  clearScreen();
	  if(mainMenuPage == 0){
		  displayMainPageOne();
	  }else if(mainMenuPage == 1){
		  displayMainPageTwo();
	  }else if(mainMenuPage == 2){
		  displayMainPageThree();
	  }else if(mainMenuPage == 3){
		  displayMainPageFour();
	  }else if(mainMenuPage == 4){
		  displayMainPageFive();
	  }
}

void ExitToMain(){
	mainMenuPage = 0;
	clearScreen();
	displayMainPageOne();
}

void split(char * strin,char * splitBy, uint32_t* result){
    int counter = 0;
    char *pt;
    pt = strtok (strin,splitBy);
    while (pt != NULL) {
        int a = atoi(pt);
        result[counter] = a;
        counter ++;
        pt = strtok (NULL, splitBy);
    }
}
int RandomNumberGenerator(const int nMin, const int nMax){
  int nRandonNumber = 0;
  nRandonNumber = rand()%(nMax-nMin) + nMin;
  return nRandonNumber;
}
int wifiOptionPage(){
	printToScreen("Init");
	HAL_Delay(200);
	clearScreen();
	uint8_t cExit = 0;
	char publicIndexs[32];
    for(uint8_t i=0;i<32;i++){
    	publicIndexs[i] = 0;
    }
	while(1){
		const int enterBufferMaxSize = 5;
		uint8_t enterBuffer[enterBufferMaxSize];
		int enterBufferLen = 0;
		clearBufferString(enterBuffer,enterBufferMaxSize);

		uint32_t p = 4;//init as a illegal value
		uint32_t q = 4;
		printToScreen("enter fist prime");
		//find p by entering the value
		while(1){
			char keyPadReading = getOneCharFromKeypad();
			if(keyPadReading == 'A'){
				ExitToMain();
				return 0;
				break;
			}
			HAL_Delay(100);
			if(keyPadReading == '#'){
				p = atoi(enterBuffer);
				clearScreen();
				clearBufferString(enterBuffer,enterBufferMaxSize);
				enterBufferLen = 0;
				break;
			}
			if((keyPadReading != 'n') && (enterBufferLen <= enterBufferMaxSize-1) && (keyPadReading != '#')&&(keyPadReading != '*') &&
					(keyPadReading != 'A') && (keyPadReading != 'B')&& (keyPadReading != 'C') &&(keyPadReading != 'D')){
				enterBuffer[enterBufferLen] = keyPadReading;
				enterBufferLen += 1;
				clearScreen();
				printToScreen("enter fist prime");
				printToScreen(" ");
				printToScreen((char *)enterBuffer);
			}
		}

		printToScreen("second prime");
		clearBufferString(enterBuffer,enterBufferMaxSize);

		while(1){
			char keyPadReading = getOneCharFromKeypad();
			if(keyPadReading == 'A'){
				ExitToMain();
				return 0;
				break;
			}
			HAL_Delay(100);
			if(keyPadReading == '#'){
				q = atoi(enterBuffer);
				clearScreen();
				//clearBufferString(enterBuffer,enterBufferMaxSize);
				enterBufferLen = 0;
				break;
			}
			if((keyPadReading != 'n') && (enterBufferLen <= enterBufferMaxSize-1) && (keyPadReading != '#')&&(keyPadReading != '*') &&
					(keyPadReading != 'A') && (keyPadReading != 'B')&& (keyPadReading != 'C') &&(keyPadReading != 'D')){
				enterBuffer[enterBufferLen] = keyPadReading;
				enterBufferLen += 1;
				clearScreen();
				printToScreen("second prime");
				printToScreen(" ");
				printToScreen((char *)enterBuffer);
			}
		}

		if(enterBuffer[0] == 0){
			continue;
		}

