kaifanzheng/STM32EncryptedCommunication/ProjectFile(EncryptedCommunication)/Src/main.c
		printToScreen("Initializing..");
		if(IniteCrypto(p,q) == 1){
			printToScreen("input OK");
			thePrivateKey = getPrivateKey();
			printToScreen("your pKey is:");
			char pkey[32];
		    for(uint8_t i=0;i<32;i++){
		    	pkey[i] = 0;
		    }
			itoa(thePrivateKey, pkey, 10);
			printToScreen(pkey);
			//mod
			uint32_t theMod = getPublicMod();
			char pmod[16];
		    for(uint8_t i=0;i<16;i++){
		    	pmod[i] = 0;
		    }
			itoa(theMod, pmod, 10);
			//and power
			uint32_t thePower = getPublicKey();
			char pPower[16];
		    for(uint8_t i=0;i<16;i++){
		    	pPower[i] = 0;
		    }
			itoa(thePower, pPower, 10);
			//cat
			strcat(publicIndexs,pmod);
			strcat(publicIndexs,",");
			strcat(publicIndexs,pPower);
			printToScreen("your m&p is:");
			printToScreen(publicIndexs);
			HAL_Delay(2000);
			break;
		}else{
			printToScreen(" ");
			printToScreen("input failed");
			HAL_Delay(1000);
			clearScreen();
		}
	}

	uint32_t counter = 0;
	printToScreen("Connecting..");
	uint8_t isGot = 0;
	srand(time(NULL));
	while(1){
		char keyPadReading = getOneCharFromKeypad();
		if(keyPadReading == 'A'){
			ExitToMain();
			return 0;
			break;
		}
		uint8_t timeOut[4] = {50,100,150,200};
		uint8_t getBuffer[32];
		clearBufferString(getBuffer,32);
		HAL_UART_Init(&huart4);
		HAL_UART_Transmit(&huart4,(uint8_t *)publicIndexs,32 , 100);
		HAL_UART_Init(&huart4);
		HAL_UART_Receive(&huart4, getBuffer,32 ,(timeOut[RandomNumberGenerator(0,4)]));
		if(getBuffer[0] != 0){
			clearScreen();
			printToScreen("Initializing..");
			printToScreen(" ");
			printToScreen("message got:");
			printToScreen(getBuffer);
			uint32_t result[2];
			split(getBuffer,",",result);
			publicMod = result[0];
			publicPower = result[1];

			isGot = 1;
			break;
		}
	}
	printToScreen("transmitting..");
	while(isGot){
		char keyPadReading = getOneCharFromKeypad();
		if(keyPadReading == 'A'){
			ExitToMain();
			return 0;
			break;
		}

		HAL_UART_Init(&huart4);
		HAL_UART_Transmit(&huart4,(uint8_t *)publicIndexs,32 , 100);
	}

}

void decodeGetMessage(uint32_t *buffer,uint32_t size,uint32_t publicModi, uint32_t privateKeyi){
	for(uint32_t i=0;i<size;i++){
		buffer[i] = decode(publicModi,privateKeyi,buffer[i]);
	}
}
void encodeSendMessage(uint8_t *buffer,char *resultBuffer,uint32_t size,uint32_t publicModi, uint32_t publicKey){
	char x[32];
	for(uint32_t i=0;i<size;i++){
		if(buffer[i]!=0){
			clearBufferString(x,32);
			uint32_t index = encode(publicModi,publicKey,buffer[i]);
			itoa(index,x, 10);
			strcat(resultBuffer,x);
			strcat(resultBuffer,".");
		}
	}
}
void sendMessagePage(){
	//init for buffer sending
	const int sendBufferMaxSize = 15;
	uint8_t sendBuffer[sendBufferMaxSize];
	int BufferLen = 0;
	clearBufferString(sendBuffer,sendBufferMaxSize);

	printToScreen("send Message");
	HAL_Delay(200);
	while(1){
		char keyPadReading = getOneCharFromKeypad();
		if(keyPadReading == 'A'){
			ExitToMain();
			break;
		}
		HAL_Delay(100);
		//
		if(keyPadReading == '#'){
			char resultBuffer[64];
			for(uint32_t i = 0;i<64;i++){
				resultBuffer[i] = 0;
			}
			if(sendBuffer[0] == 'B'){
				clearBufferString(sendBuffer,sendBufferMaxSize);
				char x[15];
				int temp = read_temperature();
				itoa(temp,x, 10);
				strcat(sendBuffer,x);

			}else if(sendBuffer[0] == 'C'){
				clearBufferString(sendBuffer,sendBufferMaxSize);
				char x[15];
				int temp = read_humidity();
				itoa(temp,x, 10);
				strcat(sendBuffer,x);
			}
			encodeSendMessage(sendBuffer,resultBuffer,sendBufferMaxSize,publicMod,publicPower);
			HAL_UART_Init(&huart4);
			HAL_UART_Transmit(&huart4, (uint8_t *)resultBuffer,64 , 10000);
			clearScreen();
			clearBufferString(sendBuffer,sendBufferMaxSize);
			BufferLen = 0;
			printToScreen("send Message");
		}

		if((keyPadReading != 'n') && (BufferLen <= 14) && (keyPadReading != '#')&&(keyPadReading != '*')){
			sendBuffer[BufferLen] = keyPadReading;
			BufferLen += 1;
			clearScreen();
			printToScreen("send Message");
			printToScreen(" ");
			printToScreen((char *)sendBuffer);
		}
	}
}
void getMessagePage(){
	printToScreen("get Message");
	HAL_Delay(200);
	while(1){
		char keyPadReading = getOneCharFromKeypad();
		if(keyPadReading == 'A'){
			ExitToMain();
			break;
		}
		uint8_t getBuffer[64];
		clearBufferString(getBuffer,64);
		HAL_UART_Init(&huart4);
		if(HAL_UART_Receive(&huart4,getBuffer, 64, 250) == HAL_OK && getBuffer[0] != 0 && strchr((char*)getBuffer, ',') == NULL){
			uint32_t result[15];
			for(uint32_t i=0;i<15;i++){
				result[i] = 0;
			}
			split(getBuffer,".",result);
			uint8_t mes[15];
			for(uint8_t i=0;i<15;i++){
				mes[i] = (uint8_t) result[i];
			}
			printToScreen((char *) mes);
		}

	}
	ExitToMain();
}
void testSpeakerPage(){
	if(next_message_in_history == 0){
		return;
	}
	uint32_t i = 1;
	char c;
	printToScreen("msg history");
	HAL_Delay(200);
	printToScreen(" ");
	char result[15];
	for(uint8_t i = 0;i<15;i++){
		result[i] = 0;
	}
	for(uint8_t j =0;j<15;j++){
		result[j] = (char)(uint8_t)message_history_encoded[next_message_in_history - i][j];
	}
	printToScreen("received:");
	printToScreen(result);
	for(uint8_t j =0;j<15;j++){
		result[j] = (char)(uint8_t)message_history_buffer[next_message_in_history - i][j];
	}
	printToScreen("decoded:");
	printToScreen(result);
	while(1){
		c = getOneCharFromKeypad();
		if(c == 'A'){
			ExitToMain();
			break;
		} else if(c == '3'){
			if(i < next_message_in_history-1){
				i += 1;
				clearScreen();
				printToScreen("msg history");
				printToScreen(" ");
				for(uint8_t j =0;j<15;j++){
					result[j] = (char)(uint8_t)message_history_encoded[next_message_in_history - i][j];
				}
				printToScreen("received:");
				printToScreen(result);
				for(uint8_t j =0;j<15;j++){
					result[j] = (char)(uint8_t)message_history_buffer[next_message_in_history - i][j];
				}
				printToScreen("decoded:");
				printToScreen(result);
			}
		} else if(c == '1'){
			if(i > 1){
				i -= 1;
				clearScreen();
				printToScreen("msg history");
				printToScreen(" ");
				for(uint8_t j =0;j<15;j++){
					result[j] = (char)(uint8_t)message_history_encoded[next_message_in_history - i][j];
				}
				printToScreen("received:");
				printToScreen(result);
				for(uint8_t j =0;j<15;j++){
					result[j] = (char)(uint8_t)message_history_buffer[next_message_in_history - i][j];
				}
				printToScreen("decoded:");
				printToScreen(result);
			}
		}
		if(getMessageMain() == 1){
			i = 1;
			clearScreen();
			printToScreen("msg history");
			printToScreen(" ");
			for(uint8_t j =0;j<15;j++){
				result[j] = (char)(uint8_t)message_history_encoded[next_message_in_history - i][j];
			}
			printToScreen("received:");
			printToScreen(result);
			for(uint8_t j =0;j<15;j++){
				result[j] = (char)(uint8_t)message_history_buffer[next_message_in_history - i][j];
			}
			printToScreen("decoded:");
			printToScreen(result);
		}
		//HAL_Delay(100);
	}
}
void getTemperaturePage(){
	printToScreen("Data");
	HAL_Delay(100);
	float tem =0;
	float hum =0;
	float temp = 0;
	float hump = 0;
	while(1){
		if(getOneCharFromKeypad() == 'A'){
			ExitToMain();
			break;
		}
		HAL_Delay(200);
		temp = tem;
		hump = hum;
		tem = read_temperature();
		hum = read_humidity();
		if(temp != tem || hump != hum){
			clearScreen();
			char temBuf[15];
			char humBuf[15];
			gcvt(tem, 8, temBuf);
			gcvt(hum, 8, humBuf);
			printToScreen("t and h are:");
			printToScreen("");
			printToScreen(temBuf);
			printToScreen( humBuf);

