kaifanzheng/STM32EncryptedCommunication/ProjectFile(EncryptedCommunication)/Src/main.c
		}
	}
}

void enterPageMainPage(){
	  clearScreen();
	  if(mainMenuPage == 0){
		  wifiOptionPage();
	  }else if(mainMenuPage == 1){
		  sendMessagePage();
	  }else if(mainMenuPage == 2){
		  getMessagePage();
	  }else if(mainMenuPage == 3){
		  testSpeakerPage();
	  }else if(mainMenuPage == 4){
		  getTemperaturePage();
	  }
}

void UILogic(){
	char keypadInputMain = getOneCharFromKeypad();
	if(keypadInputMain == '1'){
		if(mainMenuPage>0){
			mainMenuPage -= 1;
			changePageMainPage();
		}
	}else if(keypadInputMain == '3'){
		if(mainMenuPage<4){
			mainMenuPage += 1;
			changePageMainPage();
		}
	}else if(keypadInputMain == 'A'){
		enterPageMainPage();
	}
}

int getMessageMain(){
	int x = 0;
	uint8_t getBuffer[64];
	clearBufferString(getBuffer,64);
	HAL_UART_Init(&huart4);
	if(HAL_UART_Receive(&huart4,getBuffer, 64, 275) == HAL_OK && getBuffer[0] != 0 && strchr((char*)getBuffer, ',') == NULL){
		x = 1;
		uint32_t result[15];
		for(uint32_t i=0;i<15;i++){
			result[i] = 0;
		}
		split(getBuffer,".",result);
		hardcopy_char(result, 15, message_history_encoded[next_message_in_history]);
		decodeGetMessage(result,15,getPublicMod(), thePrivateKey);
		//clearScreen();
		hardcopy_char(result, 15, message_history_buffer[next_message_in_history]);
		play_ringtone();
		next_message_in_history = (next_message_in_history+1)%1024;
	}
	return x;
}

//test for data transfer----
void testSend(){
	//HAL_UART_Init(&huart4);
	uint8_t buf[5];
	uint8_t counter = 0;
	while(1){
		clearBufferString(buf,5);
		if(counter % 2 == 0){
			sprintf(buf, "hello");
			HAL_UART_Transmit(&huart4, (uint8_t*) buf, (uint16_t) strlen(buf), 10000);
			printToScreen("sent hello");
		}else{
			sprintf(buf, "happy");
			HAL_UART_Transmit(&huart4, (uint8_t*) buf, (uint16_t) strlen(buf), 10000);
			printToScreen("sent happy");
		}
//		sprintf(buf, "hello");
//		HAL_UART_Transmit(&huart4, (uint8_t*) buf, (uint16_t) strlen(buf), 10000);
		counter = (counter+1)%4;
		HAL_Delay(2000);
	}
}


void testGet(){
	//HAL_UART_Init(&huart4);
	uint8_t buf[5];
	while(1){
//		printToScreen("start to get:");
//		printToScreen("");
		clearBufferString(buf,5);
		HAL_UART_Receive(&huart4, (uint8_t*) buf, (uint16_t) 5, 10000);
		printToScreen((char *) buf);
		HAL_Delay(1000);
	}
}


/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_DAC1_Init();
  MX_TIM2_Init();
  MX_TIM3_Init();
  MX_OCTOSPI1_Init();
  MX_I2C1_Init();
  MX_SPI3_Init();
  MX_UART4_Init();
  MX_I2C2_Init();
  /* USER CODE BEGIN 2 */

  // Testssd1306Driver();
  // generate_ringtone(ringtone_note_1, ringtone_note_2, ringtone_note_3, ringtone_note_4);
  generate_ringtone(ringtone, 1);
  HAL_TIM_Base_Start_IT(&htim2);
  BSP_HSENSOR_Init();
  BSP_TSENSOR_Init();
  HAL_UART_Init(&huart4);
  // play_ringtone();
  play_ringtone();
  //initeScreen and UI
  InitScreen();
  displayMainPageOne();
  IniteCrypto(53, 59);

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
	  //testKeypadDriver();
	  //testOLEDScreenDriverPrint();
	  //testCryotoSystem();
	  //testSend();
	  //testGet();
	  //take keypad input to flip page

	  UILogic();

	  getMessageMain();

    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  if (HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_MSI;
  RCC_OscInitStruct.MSIState = RCC_MSI_ON;
  RCC_OscInitStruct.MSICalibrationValue = 0;
  RCC_OscInitStruct.MSIClockRange = RCC_MSIRANGE_6;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_MSI;
  RCC_OscInitStruct.PLL.PLLM = 1;
  RCC_OscInitStruct.PLL.PLLN = 40;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV2;
  RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV2;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_3) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief DAC1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_DAC1_Init(void)
{

  /* USER CODE BEGIN DAC1_Init 0 */

  /* USER CODE END DAC1_Init 0 */

  DAC_ChannelConfTypeDef sConfig = {0};

  /* USER CODE BEGIN DAC1_Init 1 */

  /* USER CODE END DAC1_Init 1 */

  /** DAC Initialization
  */
  hdac1.Instance = DAC1;
  if (HAL_DAC_Init(&hdac1) != HAL_OK)
  {
    Error_Handler();
  }

  /** DAC channel OUT2 config
  */
  sConfig.DAC_SampleAndHold = DAC_SAMPLEANDHOLD_DISABLE;
  sConfig.DAC_Trigger = DAC_TRIGGER_T2_TRGO;
  sConfig.DAC_HighFrequency = DAC_HIGH_FREQUENCY_INTERFACE_MODE_ABOVE_80MHZ;
  sConfig.DAC_OutputBuffer = DAC_OUTPUTBUFFER_ENABLE;
  sConfig.DAC_ConnectOnChipPeripheral = DAC_CHIPCONNECT_DISABLE;
  sConfig.DAC_UserTrimming = DAC_TRIMMING_FACTORY;
  if (HAL_DAC_ConfigChannel(&hdac1, &sConfig, DAC_CHANNEL_2) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN DAC1_Init 2 */

  /* USER CODE END DAC1_Init 2 */

